количество_записей = int(input("введите количество записей в БД ДНС сервера: ").strip())
бд = {}
for _ in range(количество_записей):
    строка = input("введите доменное имя и ip: ").strip()
    if not строка:
        continue
    части = строка.split()
    домен_из_бд = части[0]
    ip_из_бд = части[-1]
    бд[домен_из_бд.lower()] = ip_из_бд
url = input("введите url адрес ресурса: ").strip()
часть_после_протокола = url.split("://")[-1]
хост_с_портом = часть_после_протокола.split("/")[0]
домен = хост_с_портом.split(':')[0].lower()
print(бд.get(домен, "Domain not found =("))
